JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/genltl.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>genltl</code></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="<code>genltl</code>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-21T17:43+0200"/>
<meta name="author" content="Alexandre Duret-Lutz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="http://spot.lip6.fr/css/spot-zenburn.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:center;white-space:nowrap;">
 <a accesskey="h" href="tools.html">UP</a> | <a accesskey="H" href="tools.html">HOME</a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><code>genltl</code></h1>

<p>This tool generates LTL formulas according to scalable patterns.
These pattern are usually taken from the literature (see the man page
for references).  Sometimes the same pattern is given different names
in different papers, so we alias different option names to the same
pattern.
</p>




<pre class="example">--and-f=RANGE, --gh-e=RANGE
                       F(p1)&amp;F(p2)&amp;...&amp;F(pn)
--and-fg=RANGE         FG(p1)&amp;FG(p2)&amp;...&amp;FG(pn)
--and-gf=RANGE, --ccj-phi=RANGE, --gh-c2=RANGE
                       GF(p1)&amp;GF(p2)&amp;...&amp;GF(pn)
--ccj-alpha=RANGE      F(p1&amp;F(p2&amp;F(p3&amp;...F(pn)))) &amp;
                       F(q1&amp;F(q2&amp;F(q3&amp;...F(qn))))
--ccj-beta=RANGE       F(p&amp;X(p&amp;X(p&amp;...X(p)))) &amp; F(q&amp;X(q&amp;X(q&amp;...X(q))))
--ccj-beta-prime=RANGE F(p&amp;(Xp)&amp;(XXp)&amp;...(X...X(p))) &amp;
                       F(q&amp;(Xq)&amp;(XXq)&amp;...(X...X(q)))
--gh-q=RANGE           (F(p1)|G(p2))&amp;(F(p2)|G(p3))&amp;... &amp;(F(pn)|G(p{n+1}))
                      
--gh-r=RANGE           (GF(p1)|FG(p2))&amp;(GF(p2)|FG(p3))&amp;...
                       &amp;(GF(pn)|FG(p{n+1}))
--go-theta=RANGE       !((GF(p1)&amp;GF(p2)&amp;...&amp;GF(pn)) -&gt; G(q-&gt;F(r)))
--or-fg=RANGE, --ccj-xi=RANGE
                       FG(p1)|FG(p2)|...|FG(pn)
--or-g=RANGE, --gh-s=RANGE   G(p1)|G(p2)|...|G(pn)
--or-gf=RANGE, --gh-c1=RANGE
                       GF(p1)|GF(p2)|...|GF(pn)
--r-left=RANGE         (((p1 R p2) R p3) ... R pn)
--r-right=RANGE        (p1 R (p2 R (... R pn)))
--rv-counter=RANGE     n-bit counter
--rv-counter-carry=RANGE   n-bit counter w/ carry
--rv-counter-carry-linear=RANGE
                       n-bit counter w/ carry (linear size)
--rv-counter-linear=RANGE   n-bit counter (linear size)
--u-left=RANGE, --gh-u=RANGE
                       (((p1 U p2) U p3) ... U pn)
--u-right=RANGE, --gh-u2=RANGE, --go-phi=RANGE
                       (p1 U (p2 U (... U pn)))
</pre>


<p>
An example is probably all it takes to understand how this tool works:
</p>



<pre class="src src-sh">genltl --and-gf=1..5 --u-left=1..5
</pre>


<pre class="example">GFp1
GFp1 &amp; GFp2
GFp1 &amp; GFp2 &amp; GFp3
GFp1 &amp; GFp2 &amp; GFp3 &amp; GFp4
GFp1 &amp; GFp2 &amp; GFp3 &amp; GFp4 &amp; GFp5
p1
p1 U p2
(p1 U p2) U p3
((p1 U p2) U p3) U p4
(((p1 U p2) U p3) U p4) U p5
</pre>


<p>
<code>genltl</code> supports the <a href="ioltl.html">common option for output of LTL formulas</a>, so you
may output these pattern for various tools.
</p>
<p>
For instance here is the same formulas, but formatted in a way that is
suitable for being included in a LaTeX table.
</p>




<pre class="src src-sh">genltl --and-gf=1..5 --u-left=1..5 --latex --format=<span class="org-string">'%F &amp; %L &amp; $%f$ \\'</span>
</pre>


<pre class="example">and-gf &amp; 1 &amp; $\G \F p_{1}$ \\
and-gf &amp; 2 &amp; $\G \F p_{1} \land \G \F p_{2}$ \\
and-gf &amp; 3 &amp; $\G \F p_{1} \land \G \F p_{2} \land \G \F p_{3}$ \\
and-gf &amp; 4 &amp; $\G \F p_{1} \land \G \F p_{2} \land \G \F p_{3} \land \G \F p_{4}$ \\
and-gf &amp; 5 &amp; $\G \F p_{1} \land \G \F p_{2} \land \G \F p_{3} \land \G \F p_{4} \land \G \F p_{5}$ \\
u-left &amp; 1 &amp; $p_{1}$ \\
u-left &amp; 2 &amp; $p_{1} \U p_{2}$ \\
u-left &amp; 3 &amp; $(p_{1} \U p_{2}) \U p_{3}$ \\
u-left &amp; 4 &amp; $((p_{1} \U p_{2}) \U p_{3}) \U p_{4}$ \\
u-left &amp; 5 &amp; $(((p_{1} \U p_{2}) \U p_{3}) \U p_{4}) \U p_{5}$ \\
</pre>


<p>
Note that for the <code>--lbt</code> syntax, each formula is relabeled using
<code>p0</code>, <code>p1</code>, &hellip;  before it is output, when the pattern (like
<code>--ccj-alpha</code>) use different names.  Compare:
</p>



<pre class="src src-sh">genltl --ccj-alpha=3
</pre>

<pre class="example">
F(q1 &amp; F(q2 &amp; Fq3)) &amp; F(p1 &amp; F(p2 &amp; Fp3))
</pre>


<p>
with
</p>



<pre class="src src-sh">genltl --ccj-alpha=3 --lbt
</pre>

<pre class="example">
&amp; F &amp; p0 F &amp; p1 F p2 F &amp; p3 F &amp; p4 F p5
</pre>


<p>
This is because most tools using <code>lbt</code>'s syntax require atomic
propositions to have the form <code>pNN</code>.
</p>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-21T17:43+0200</p>
<p class="author">Author: Alexandre Duret-Lutz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
